02-mendesain-halaman-web.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Desain Media Interaktif</title>
<meta name="author" content="Dhimas Widrayato"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/css/reveal.css"/>

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/css/theme/simple.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Desain Media Interaktif</h1> <p><strong>Mendesain Web</strong></p> <p>Dhimas Widrayato<br />&lt;<a href="mailto:dhimas@lepisi.ac.id">dhimas@lepisi.ac.id</a>&gt;</p>
</section>

<section>
<section id="slide-org8ceab32">
<h2 id="org8ceab32">Pendahuluan</h2>
<p>
Kerjakan dahulu latihan soal sebelum lanjut ke materi ini!
</p>

</section>
</section>
<section>
<section id="slide-org2919ca9">
<h2 id="org2919ca9">Desain Web</h2>
<p>
Desain website terbagi menjadi dua bagian:
</p>

<ul>
<li>desain tampilan</li>
<li>desain fungsi</li>

</ul>

</section>
</section>
<section>
<section id="slide-org45bfea1">
<h2 id="org45bfea1">Desain Tampilan</h2>
<p>
Mendesain tampilan sebuah website mirip seperti mendesain tampilan sebuah majalah
yang panjang halamannya tidak terbatas.
</p>

</section>
<section id="slide-orgfa83fc6">
<h3 id="orgfa83fc6">Hal yang perlu diperhatikan</h3>
<p>
Tampilan website perlu:
</p>

<ul>
<li>skema warna yang konsisten dan tidak berlebihan</li>
<li>jenis huruf dipilih sesuai kegunaan</li>
<li>konsistensi perataan dan peletakan elemen-elemen desain</li>

</ul>

</section>
<section id="slide-org70c83b6">
<h4 id="org70c83b6">Skema warna</h4>
<p>
Sebuah website dapat terdiri dari beberapa ratus halaman web, untuk membuatnya
terlihat sebagai suatu kesatuan, maka diperlukan skema warna. Biasanya terdiri
dari warna utama, warna aksen, warna terang dan gelap serta warna tambahan seperlunya.
</p>

</section>
<section>
<p>
Contoh website yang menggunakan warna dengan baik dapat dilihat di artikel <a href="https://designshack.net/articles/trends/best-website-color-schemes/">ini</a> dan <a href="https://www.quicksprout.com/trending-website-color-schemes/">ini</a>.
</p>

<p>
Desainer dapat membuat skema warnanya sendiri, namun untuk pemula bisa menggunakan
generator seperti <a href="https://coolors.co/generate">generator ini</a>.
</p>

</section>
<section id="slide-org6b0db2f">
<h4 id="org6b0db2f">Jenis huruf</h4>
<p>
Jenis huruf pada website umumnya terbagi menjadi tiga jenis:
</p>

<ul>
<li>huruf judul</li>
<li>huruf badan teks</li>
<li>huruf spesial (kutipan, dekoratif, kode program)</li>

</ul>

</section>
<section>
<ul class="org-ul">
<li><a id="org6bd5399"></a>Sesuaikan jenis huruf dengan isi<br />
<p>
Jenis huruf yang dipilih harus mendukung informasi apa yang ditampilkan, contohnya,
untuk website yang bersifat formal seperti sekolah, perusahaan dan institusi pemerintah, jenis
huruf yang dipilih tidak boleh yang terlihat "main-main" seperti Comic Sans.
</p>

</section>
<section>
</li>
<li><a id="orgcce3f42"></a>Lisensi<br />
<p>
Pemilihan jenis huruf pada website juga harus memperhatikan lisensi huruf, tidak
semua huruf bisa dan boleh digunakan secara bebas di website. Sebaiknya gunakan huruf-huruf
yang berlisensi SIL jika pemilik website tidak memiliki lisensi menggunakan huruf pada website.
</p>

</section>
<section>
</li>
<li><a id="orgcdcf0e6"></a>Web fonts<br />
<p>
Ada banyak penyedia huruf web (web fonts), seperti <a href="https://fonts.google.com/">google fonts</a>, <a href="https://fonts.adobe.com/">Adobe fonts</a>, <a href="https://www.fontsquirrel.com/">Font Squirrel</a>, <a href="https://www.theleagueofmoveabletype.com/">The League of Moveable Type</a>, <a href="https://developer.mozilla.org/en-US/docs/Learn/CSS/Styling_text/Web_fonts#Finding_fonts">dll</a>.
</p>

</section>
<section>
</li>
<li><a id="orga374200"></a>Font pairing<br />
<p>
Memilih pasangan huruf judul dan badan teks adalah salah satu hal yang paling sulit
untuk dilakukan terutama untuk desainer pemula. Untuk itu, usahakan sebanyak mungkin
melihat pasangan huruf judul dan badan teks yang kamu bisa untuk memperluas wawasan.
</p>

<p>
Kamu bisa melihat contoh font matching pada website <a href="https://fontpair.co/">ini</a>, <a href="https://www.canva.com/learn/the-ultimate-guide-to-font-pairing/">ini</a>, atau di <a href="https://www.pagecloud.com/blog/best-google-fonts-pairings">sini</a>.
Selain itu, kamu juga bisa mencoba sendiri di <a href="https://www.canva.com/font-combinations/">sini</a>.
</p>
</li>
</ul>

</section>
<section id="slide-org40385a0">
<h4 id="org40385a0">Perataan dan Peletakan (Layout)</h4>
<p>
Peletakan dan perataan elemen desain menjadi sangat jelas terlihat pada halaman web.
Sebuah halaman web akan terasa "salah" jika perataan dan peletakan elemen-elemennya tidak
konsisten.
</p>

<p>
Contoh-contoh layout pada halaman web dapat dilihat di <a href="https://xd.adobe.com/ideas/principles/web-design/11-website-layouts-that-made-content-shine-in-2019/">sini</a>, <a href="https://www.geeksforgeeks.org/css-website-layout/">sini</a>, <a href="https://designshack.net/articles/layouts/10-rock-solid-website-layout-examples/">sini</a>, <a href="https://en.wikipedia.org/wiki/Web_design">dll</a>.
</p>

</section>
<section>
<ul class="org-ul">
<li><a id="orgbc0f037"></a>Jenis layout<br />
<p>
Secara umum jenis layout dibagi menjadi:
</p>

<ul>
<li>Static (website didesain dengan lebar yang tetap, jika layar lebih sempit, maka muncul scrollbar horizontal)</li>
<li>Fluid (website didesain dengan lebar yang dinamis, biasanya menggunakan persentase dalam menentukan lebarnya)</li>
<li>Responsive (gabungan dari static dan fluid, biasanya tampilan dapat berubah sesuai dengan lebar layar)</li>

</ul>
</li>
</ul>
</section>
</section>
</div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/lib/js/head.min.js"></script>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'convex', // see README of reveal.js for options
transitionSpeed: 'default',

// Optional libraries used to extend reveal.js
dependencies: [
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }]

});
</script>
</body>
</html>
